# Import Pandas Library

In [1]:
import pandas as pd

# Create a Data Frame

In [2]:
df1 = pd.DataFrame(0, index = ['X', 'Y', 'Z'], columns = ['c1', 'c2'])

In [3]:
df1

   c1  c2
X   0   0
Y   0   0
Z   0   0

# Reset Indices

In [4]:
df1.reset_index()

  index  c1  c2
0     X   0   0
1     Y   0   0
2     Z   0   0

### 

# Exercise

In [5]:
import numpy as np
from numpy.random import randn

In [6]:
np.random.seed(100212251) # Keep the same result

In [7]:
df = pd.DataFrame(randn(2,3), index = ['X', 'Y'], columns = ['c1', 'c2', 'c3'])

In [8]:
df

         c1        c2        c3
X  1.056924  1.254387 -1.821241
Y -1.033658 -1.620970  1.574977

# Get a specific column

In [9]:
df['c1']

X    1.056924
Y   -1.033658
Name: c1, dtype: float64

In [10]:
df['c1'].to_frame()

         c1
X  1.056924
Y -1.033658

In [11]:
df[['c1', 'c3']]

         c1        c3
X  1.056924 -1.821241
Y -1.033658  1.574977

# Add  a new column

In [12]:
df['c_new'] = df['c1'] + df['c2']

In [13]:
df

         c1        c2        c3     c_new
X  1.056924  1.254387 -1.821241  2.311311
Y -1.033658 -1.620970  1.574977 -2.654628

# Print a row

In [14]:
df.loc['Y']

c1      -1.033658
c2      -1.620970
c3       1.574977
c_new   -2.654628
Name: Y, dtype: float64

In [15]:
df.loc['Y'].to_frame()

              Y
c1    -1.033658
c2    -1.620970
c3     1.574977
c_new -2.654628

In [16]:
df.iloc[1]

c1      -1.033658
c2      -1.620970
c3       1.574977
c_new   -2.654628
Name: Y, dtype: float64

In [17]:
df.iloc[1].to_frame()

              Y
c1    -1.033658
c2    -1.620970
c3     1.574977
c_new -2.654628

### 

# Exercise

In [18]:
df.loc[['X'], ['c1', 'c2', 'c_new']]

         c1        c2     c_new
X  1.056924  1.254387  2.311311

###

In [19]:
df.loc['X', 'c3']

-1.8212406424291276

# Drop

In [20]:
df.drop('c3', axis = 1) # 1 -> Columns

         c1        c2     c_new
X  1.056924  1.254387  2.311311
Y -1.033658 -1.620970 -2.654628

In [21]:
df.drop('Y', axis = 0) # 0 -> Rows

         c1        c2        c3     c_new
X  1.056924  1.254387 -1.821241  2.311311

# Inplace

In [22]:
df.drop('c3', axis = 1, inplace = True)

In [23]:
df

         c1        c2     c_new
X  1.056924  1.254387  2.311311
Y -1.033658 -1.620970 -2.654628

# Bye